In [1]:
import pandas as pd

## Data EXPLORATION

In [2]:
df=pd.read_csv("data.csv")

In [3]:
df

    name   age
0  Alice  25.0
1    Bob  30.0
2   rita  30.0

In [4]:
df.head(2)

    name   age
0  Alice  25.0
1    Bob  30.0

In [5]:
df.tail(1)

   name   age
2  rita  30.0

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      float64
dtypes: float64(1), object(1)
memory usage: 180.0+ bytes

In [7]:
df.isnull()

    name    age
0  False  False
1  False  False
2  False  False

In [8]:
df.describe()

             age
count   3.000000
mean   28.333333
std     2.886751
min    25.000000
25%    27.500000
50%    30.000000
75%    30.000000
max    30.000000

In [9]:
df.value_counts()

name   age
Alice  25.0    1
Bob    30.0    1
rita   30.0    1
Name: count, dtype: int64

In [10]:
df['name'].nunique()

3

In [11]:
df.shape

(3, 2)

In [16]:
df['age'].nunique()

2

In [13]:
df.isnull()

    name    age
0  False  False
1  False  False
2  False  False

In [14]:
df.isnull().sum()

name    0
age     0
dtype: int64